{
	"contact": "resume@jessehattabaugh.com",
	"experience": [
		{
			"at": "Kroger",
			"credits": [ ],
			"from": "Feb 2019",
			"location": "Portland, Oregon",
			"title": "Senior React Developer",
			"to": "Nov 2019"
		},
		{
			"at": "StudyBlue",
			"credits": [
				"Led a team of frontend engineers to maintain the company’s web-based flashcard application.",
				"Overhauled the app’s legacy RequireJS-based build process to use Webpack.",
				"Improved site load time by enabling code-splitting, long-term caching, and CDN delivery.",
				"Mentored junior developers and conducted codereviews to improve code quality.",
				"Replaced the IntelliJ powered development environment with a livereloading process.",
				"Facilitated the integration of the site’s first React component inside the existing Backbone app.",
				"Conducted interviews and evaluated code challenges for the company’s open positions."
			],
			"from": "Nov 2016",
			"location": "San Francisco, California",
			"title": "Lead Frontend Developer",
			"to": "Dec 2017"
		},
		{
			"at": "Planet Labs",
			"credits": [
				"Implemented features of the company’s satellite imaging applications with ReactJS/Reflux.",
				"Developed build scripts to generate documentation for the company’s public APIs.",
				"Participated in daily scrums, and a Github based workflow using pull-requests and rebasing.",
				"Made use of ES6 and modern Web APIs like Promises and Fetch by using Babel, and Polyfill.io.",
				"Published updates to the company’s NPM packages."
			],
			"from": "Aug 2015",
			"location": "San Francisco, California",
			"title": "Senior Frontend Developer",
			"to": "Oct 2016"
		},
		{
			"at": "Eveo",
			"credits": [
				"Developed interactive presentations and mobile apps for major pharmaceutical brands.",
				"Set up NPM build systems using Gulp, Browserify, Jade, and Stylus.",
				"Constructed hybrid web apps for using Phonegap, KnockoutJS, and AngularJS.",
				"Lead a team of developers to complete projects and meet client requirements.",
				"Unit tested business logic to ensure quality using Mocha and Should.js.",
				"Managed Git branching strategy, NPM build process, and Heroku deployments.",
				"Triaged bugs in Jira, communicated with stakeholders on Basecamp."
			],
			"from": "Oct 2012",
			"location": "San Francisco, California",
			"title": "Senior Frontend Developer",
			"to": "Jun 2015"
		},
		{
			"at": "CubeTree",
			"credits": [
				"Used Agile techniques to develop features for the company's Ruby on Rails app.",
				"Built front-end ui components with YUI and Web Standards.",
				"Used TDD to define business logic and prevent regressions in a weekly release cycle.",
				"Improved support for legacy browsers such as IE6.",
				"Retrofitted application for translation and localization."
			],
			"from": "Mar 2010",
			"location": "San Francisco, California",
			"title": "Ruby on Rails Developer",
			"to": "Dec 2010"
		},
		{
			"at": "CBS Interactive",
			"credits": [
				"Maintained high traffic MVC application (TV.com) built with PHP and MySQL.",
				"Developed front-end controls using MooTools and jQuery.",
				"Wrote cron scripts for importing third party data from REST APIs.",
				"Integrated Facebook Connect with existing authentication system."
			],
			"from": "Aug 2008",
			"location": "San Francisco, California",
			"title": "Full Stack Developer",
			"to": "Oct 2009"
		},
		{
			"at": "Fordella",
			"credits": [
				"Migrated the company’s white label video platform to CakePHP.",
				"Utilized SVN source control system to collaborate with a team of developers.",
				"Developed feed features using RSS and Atom feeds.",
				"Used jQuery to implement Ajax features.",
				"Worked with backend services engineers to design RESTful APIs."
			],
			"from": "May 2007",
			"location": "San Francisco, California",
			"title": "Full Stack Developer",
			"to": "May 2008"
		},
		{
			"at": "Imagine That Design Studios",
			"credits": [
				"Built a social networking system for the company’s travel website.",
				"Programmed in PHP using the CakePHP MVC framework.",
				"Designed and implemented MySQL schemas.",
				"Used SSH and SFTP to perform miscellaneous sysadmin duties."
			],
			"from": "2006",
			"location": "San Francisco, California",
			"title": "Full Stack Developer",
			"to": "2007"
		},
		{
			"at": "Verisource",
			"from": "2004",
			"location": "Rogers, Arkansas",
			"title": "PHP Developer",
			"to": "2005"
		},
		{
			"at": "University of Central Arkansas",
			"from": "2002",
			"location": "Conway, Arkansas",
			"title": "Graphic Design Student",
			"to": "2004"
		},
		{
			"at": "Ad Plus Inc",
			"from": "2000",
			"location": "Fort Smith, Arkansas",
			"title": "Web Developer Internship",
			"to": "2001"
		}
	],
	"location": "Portland, Oregon",
	"of": "Jesse Hattabaugh",
	"skills": {},
	"title": "Web Expert"
}